{
  "backend/main.mo": "Backend actor defining complaint, solution, and user profile types with CRUD operations, access control, and blob storage integration.",
  "feature_evidence.json": "Feature evidence report listing logo and favicon-related features, associated components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS base setup defining light/dark theme variables and global styling.",
  "frontend/index.html": "Root HTML file including favicon reference and mounting point for the React app.",
  "frontend/src/App.tsx": "Defines TanStack Router configuration and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown to unauthorized users with messaging and a button linking back to the main board.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin-only routes by checking caller role and showing loading or access denied screens.",
  "frontend/src/components/AppLayout.tsx": "Main layout with header, logo, navigation, authentication controls, and profile setup dialog.",
  "frontend/src/components/CategoryTabs.tsx": "Tabs component for filtering complaints by category including an 'All' option.",
  "frontend/src/components/ComplaintListItem.tsx": "Card-style list item displaying complaint metadata such as category, status, urgency, and timestamp.",
  "frontend/src/components/ComplaintSearchAndFilters.tsx": "Provides UI controls for searching and filtering complaints by text, category, status, and urgency with reset support.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Displays a modal prompting new authenticated users to create a profile with name and optional email.",
  "frontend/src/components/ProofUploadField.tsx": "Handles file upload for complaint proof with size/type validation, upload progress, and removal support.",
  "frontend/src/components/solutions/RelatedLinks.tsx": "Displays related categories and complaint links for a solution update.",
  "frontend/src/components/solutions/SolutionCard.tsx": "Renders a solution update with title, timestamp, description, and related links.",
  "frontend/src/components/StatusTag.tsx": "Renders a styled badge representing a complaint's status with color-coded variants.",
  "frontend/src/components/SubmitResultBanner.tsx": "Shows a success or error alert banner with title and message after form submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAuthorization.ts": "Exposes hooks to fetch the caller's user role and admin status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and logic for login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, complaints, and related data via the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling rules.",
  "frontend/src/lib/complaintTaxonomy.ts": "Defines complaint category metadata and a helper to map category enums to readable labels.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminComplaintsPage.tsx": "Admin UI for listing all complaints with controls to update status, hide/unhide, and delete entries using query hooks and dialogs.",
  "frontend/src/pages/admin/AdminSolutionsPage.tsx": "Admin form for creating solution/update entries, allowing title, description, category selection, and linking to public complaints.",
  "frontend/src/pages/ComplaintBoardPage.tsx": "Displays public complaints with filtering, searching, and category tabs, separating active and resolved items.",
  "frontend/src/pages/ComplaintDetailPage.tsx": "Shows detailed information for a single complaint, including metadata, description, and proof.",
  "frontend/src/pages/SolutionsUpdatesPage.tsx": "Fetches and displays official solutions or updates, with loading and error handling states.",
  "frontend/src/pages/SubmitComplaintPage.tsx": "Form for submitting a new complaint with validation, authentication checks, file upload, and success/error feedback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project state metadata describing features, requirements, issues, and image processing needs."
}