{
  "backend/main.mo": "Main Motoko actor defining complaint and solution management system with types (Complaint, SolutionUpdate, UserProfile), storage maps, access control integration, and public/query methods for CRUD operations, admin allowlist queries, and user profile management.",
  "feature_evidence.json": "Feature evidence report documenting the defensive error handling added to AccessDeniedScreen component to prevent UI errors when admin allowlist fetch fails while keeping Principal ID visible and copyable.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components and pages, describing their purpose, functionality, and key features including routing, admin guards, complaint management, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color tokens for UI elements (background, foreground, primary, destructive, sidebar, charts, etc.).",
  "frontend/index.html": "HTML entry point with viewport meta tags, favicon link, page title 'FLAME Issue Tracker', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for complaint board, submission, detail, solutions, admin pages (landing, complaints, solutions, access-control), and whoami; wraps app in ThemeProvider and includes Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen with robust error handling that displays user Principal ID with copy functionality, shows appropriate messages for guest/user/admin roles, and gracefully handles admin allowlist fetch failures without breaking the UI.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard component that checks user role and only renders children for admin users, showing loading skeleton or access denied screen otherwise.",
  "frontend/src/components/AppLayout.tsx": "Main layout component with sticky header containing logo, navigation links (Complaints, Solutions, Submit, Admin), PrincipalIndicator, login/logout button, mobile menu toggle, ProfileSetupDialog, and footer with attribution.",
  "frontend/src/components/CategoryTabs.tsx": "Horizontal tabs component for filtering complaints by category (All plus categories from COMPLAINT_CATEGORIES taxonomy), with responsive wrapping and flexible tab widths.",
  "frontend/src/components/ComplaintListItem.tsx": "Renders a clickable card displaying a complaint summary with category, status, description, urgency level, and timestamp. Links to the detailed complaint view.",
  "frontend/src/components/ComplaintSearchAndFilters.tsx": "Provides search input and filter dropdowns (category, status, urgency) for complaints with a clear filters button. Manages filter state through props.",
  "frontend/src/components/PrincipalIndicator.tsx": "Displays the authenticated user's principal ID in the UI with a dialog to view full ID and copy to clipboard. Shows user role and hides for anonymous users.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and optional email. Cannot be dismissed until profile is created.",
  "frontend/src/components/ProofUploadField.tsx": "File upload input for complaint proof with validation (5MB max, JPG/PNG/PDF only), progress tracking, and preview/removal functionality using ExternalBlob.",
  "frontend/src/components/solutions/RelatedLinks.tsx": "Displays related categories as badges and related complaints as clickable links with IDs for a solution update.",
  "frontend/src/components/solutions/SolutionCard.tsx": "Card component displaying a solution update with title, description, timestamp, and related links to categories and complaints.",
  "frontend/src/components/StatusTag.tsx": "Renders a colored badge for complaint status (submitted, under review, in progress, resolved) with appropriate styling variants.",
  "frontend/src/components/SubmitResultBanner.tsx": "Alert banner component displaying success or error messages with appropriate icons and styling after form submission.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes access control, and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useAuthorization.ts": "Provides hooks to query the caller's user role and admin status from the backend actor with caching and loading states.",
  "frontend/src/hooks/useCallerInfo.ts": "React hook that fetches the current user's principal and role using TanStack Query, returning guest info when no actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout using @dfinity/auth-client, managing identity state and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of TanStack Query hooks for user profiles, complaints (CRUD operations), and solutions, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using a professional university color scheme with warm accents.",
  "frontend/src/lib/complaintTaxonomy.ts": "Defines complaint categories (food services, academics, safety, etc.) with labels and a helper function to retrieve category labels.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/admin/AdminAccessControlPage.tsx": "Admin-only page that displays the list of Principal IDs in the admin allowlist with copy-to-clipboard functionality for each principal.",
  "frontend/src/pages/admin/AdminComplaintsPage.tsx": "Admin dashboard for managing all complaints with functionality to update status, toggle visibility, and delete complaints with confirmation dialog.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Admin panel landing page with navigation cards linking to complaint management, solution management, and access control sections.",
  "frontend/src/pages/admin/AdminSolutionsPage.tsx": "Admin page for creating and publishing solutions/updates with title, description, related categories, and related complaints selection. Uses form state management, validation, and toast notifications for success/error feedback.",
  "frontend/src/pages/ComplaintBoardPage.tsx": "Displays public complaints with category tabs, search/filter controls, and separates active from resolved complaints in a grid layout.",
  "frontend/src/pages/ComplaintDetailPage.tsx": "Shows detailed view of a single complaint including description, status, urgency, timestamp, and supporting proof with navigation back to the board.",
  "frontend/src/pages/SolutionsUpdatesPage.tsx": "Displays a list of official solutions and updates to common issues using SolutionCard components with loading and error states.",
  "frontend/src/pages/SubmitComplaintPage.tsx": "Form page for authenticated users to submit complaints with category, description, urgency level, and optional proof upload; includes validation, moderation error handling, and redirects to complaint detail on success.",
  "frontend/src/pages/WhoAmIPage.tsx": "Displays the current user's Internet Computer Principal ID and role (admin/user/guest) with copy-to-clipboard functionality and optional admin debug information.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom font family (Inter), and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking complaint tracking system features, known production issues (admin panel 404, whoami endpoint 404, admin access denied), architectural notes about admin routes and authentication, and existing feature implementations."
}