{
  "backend/main.mo": "Defines actor with complaint system types and logic, including profile management, complaint submission, status updates, and access control via mixins.",
  "backend/migration.mo": "Provides a no-op migration function returning the existing actor state unchanged.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend React components and pages used across the app.",
  "frontend/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx and setting app metadata and favicon.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all routes including /api/whoami and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Renders access-denied messaging with role-specific guidance and link to /api/whoami for principal lookup.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Restricts routes to admin users, showing loading skeletons or access denied when appropriate.",
  "frontend/src/components/AppLayout.tsx": "Provides the global layout with header, navigation, authentication handling, PrincipalIndicator, and responsive UI structure.",
  "frontend/src/components/CategoryTabs.tsx": "Renders tab controls for filtering complaints by category including an 'All' option.",
  "frontend/src/components/ComplaintListItem.tsx": "Displays a complaint card with category, description, urgency, status, and relative timestamp linking to its detail page.",
  "frontend/src/components/ComplaintSearchAndFilters.tsx": "Provides search and filter controls for complaints by text, category, status, and urgency with reset support.",
  "frontend/src/components/PrincipalIndicator.tsx": "Shows the logged-in user's principal with a modal for full ID display and copy functionality.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts authenticated users without profiles to enter name and email before continuing.",
  "frontend/src/components/ProofUploadField.tsx": "Handles uploading and validating proof files with size/type checks, progress tracking, and removal.",
  "frontend/src/components/solutions/RelatedLinks.tsx": "Lists related categories and linked complaint IDs for a solution update.",
  "frontend/src/components/solutions/SolutionCard.tsx": "Displays a solution update with title, timestamp, description, and related links.",
  "frontend/src/components/StatusTag.tsx": "Displays a styled status badge based on a complaint's status value.",
  "frontend/src/components/SubmitResultBanner.tsx": "Shows a success or error alert banner with title and message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAuthorization.ts": "Provides hooks to fetch the caller's user role and admin status using the actor.",
  "frontend/src/hooks/useCallerInfo.ts": "Provides a query hook to fetch caller identity info, defaulting to a guest principal when no actor exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, complaints, and complaint updates via the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles for the app.",
  "frontend/src/lib/complaintTaxonomy.ts": "Maps complaint category enums to user-friendly labels and provides a lookup helper.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminComplaintsPage.tsx": "Admin interface for viewing, updating, hiding, and deleting complaints with status controls and confirmation dialogs.",
  "frontend/src/pages/admin/AdminLandingPage.tsx": "Landing page linking to admin tools for managing complaints and solutions.",
  "frontend/src/pages/admin/AdminSolutionsPage.tsx": "Admin form to create and publish solutions linked to categories or specific complaints.",
  "frontend/src/pages/ComplaintBoardPage.tsx": "Displays a filterable complaint board with active and resolved complaints using public complaint data.",
  "frontend/src/pages/ComplaintDetailPage.tsx": "Shows detailed information for a single complaint, including metadata, description, and proof.",
  "frontend/src/pages/SolutionsUpdatesPage.tsx": "Lists official solutions and updates with loading and error handling.",
  "frontend/src/pages/SubmitComplaintPage.tsx": "Implements a complaint submission form with validation, proof upload, authentication checks, and mutation to create a new complaint.",
  "frontend/src/pages/WhoAmIPage.tsx": "Displays the user's principal ID and role with loading states and clipboard copy support.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash‑based parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Defines overall project state, including metadata, architectural notes, issues, and implemented feature records for the complaint‑tracking system."
}