{
  "kind": "build_request",
  "title": "Fix missing Principal display and restore /api/whoami",
  "projectName": "FLAME Issue Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add a backend query method that returns the current caller’s Principal (and optionally their role) so the frontend can reliably display the logged-in identity.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "my principal isnt coming fix the site first"
        ]
      },
      "acceptanceCriteria": [
        "A new public query method exists in backend/main.mo that returns the caller Principal in a frontend-friendly format (e.g., Text).",
        "Calling the method when logged out returns the anonymous principal rather than failing.",
        "Calling the method when logged in returns the authenticated Internet Identity principal."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Create a frontend route at \"/api/whoami\" that renders a simple page showing the current Principal (and role if available) and provides a one-click copy action.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the page that is supposed to show the principal is showing not found"
        ]
      },
      "acceptanceCriteria": [
        "Visiting https://flame-issue-tracker-lm2.caffeine.xyz/api/whoami no longer shows Not Found and renders a page within the SPA.",
        "The page shows the current Principal value pulled from the backend (not hardcoded).",
        "The page includes a Copy button that copies the displayed Principal to clipboard and shows a success/toast confirmation."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Show the logged-in Principal (shortened with a full-value tooltip or expandable view) somewhere in the main authenticated UI (e.g., header area) so users can confirm which Internet Identity account is active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "my principal isnt coming fix the site first"
        ]
      },
      "acceptanceCriteria": [
        "When a user is authenticated, the UI displays a recognizable Principal indicator (e.g., first/last characters).",
        "There is a clear way to view/copy the full Principal from the UI without needing to navigate to admin routes.",
        "When logged out, the Principal indicator is not shown (or clearly indicates the user is not logged in)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the admin access denied experience to include troubleshooting guidance that directs users to \"/api/whoami\" to retrieve their Principal for admin enablement.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "its showing access denied now"
        ]
      },
      "acceptanceCriteria": [
        "The Access Denied screen includes a visible link to \"/api/whoami\" and instructs the user to copy and share the Principal with the site administrator.",
        "User-facing text is in English and clearly distinguishes ‘not admin’ from ‘not logged in’."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single backend actor at backend/main.mo (single-actor architecture).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything inside frontend/src/components/ui; compose or add new components/pages instead."
  ],
  "nonGoals": [
    "Do not automatically grant admin access to the currently logged-in Principal.",
    "Do not add third-party authentication providers; use Internet Identity only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}