{
  "kind": "build_request",
  "title": "Grant admin access to Principal jwxbf-7t3mq-z2mw2-kglpm-vjiqq-yfjhx-fxojo-5k7kl-i6gx5-idwc6-qqe",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Add the Principal ID 'jwxbf-7t3mq-z2mw2-kglpm-vjiqq-yfjhx-fxojo-5k7kl-i6gx5-idwc6-qqe' to the backend admin allowlist managed by AccessControl.isAdmin so this user can access all /admin routes and perform admin-only operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "add this principal id i still cant access the admin panel.  jwxbf-7t3mq-z2mw2-kglpm-vjiqq-yfjhx-fxojo-5k7kl-i6gx5-idwc6-qqe"
        ]
      },
      "acceptanceCriteria": [
        "The Principal 'jwxbf-7t3mq-z2mw2-kglpm-vjiqq-yfjhx-fxojo-5k7kl-i6gx5-idwc6-qqe' is added to the admin allowlist in the backend",
        "The user with this Principal can successfully access the /admin routes without seeing 'Access Denied'",
        "The AccessControl.isAdmin method returns true for this Principal",
        "The admin allowlist change persists across canister upgrades"
      ]
    },
    {
      "id": "REQ-21",
      "text": "Verify that the admin allowlist state persists correctly across canister upgrades and does not reset or drop existing admin principals when deploying this change. If a state migration is required by the current AccessControl design, implement a conditional migration that preserves all existing state while adding the new admin Principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ]
      },
      "acceptanceCriteria": [
        "Existing admin principals remain in the allowlist after upgrade",
        "The new Principal is successfully added and persists",
        "No admin access is lost during the upgrade process",
        "State migration (if needed) executes conditionally and preserves all authorization data"
      ]
    }
  ],
  "constraints": [
    "Do not modify the single-actor architecture in backend/main.mo",
    "Preserve all existing admin principals in the allowlist",
    "Ensure backward compatibility with existing AccessControl logic"
  ],
  "nonGoals": [
    "Creating a user interface for managing admin principals",
    "Implementing role-based access control beyond the existing admin allowlist",
    "Modifying frontend authentication flows"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}