{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore in-app Principal identity display and /api/whoami route",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Add an SPA route at /api/whoami that shows the current Principal (and role if available) with one-click copy.",
      "acceptanceCriteria": [
        "Visiting https://flame-issue-tracker-lm2.caffeine.xyz/api/whoami no longer shows Not Found and renders a page within the SPA.",
        "The page shows the current Principal value pulled from the backend (not hardcoded).",
        "The page includes a Copy button that copies the displayed Principal to clipboard and shows a success/toast confirmation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WhoAmIPage.tsx",
          "operation": "create",
          "description": "Create a WhoAmIPage that fetches caller identity from the backend actor (use getCurrentUserPrincipal) and renders Principal + role, plus a Copy button using clipboard API and sonner toast. Use the authorization system’s caller info/role semantics (guest vs user/admin) when presenting role; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCallerInfo.ts",
          "operation": "create",
          "description": "Add a React Query hook to fetch and cache current caller info via the backend actor (principal + role) for reuse in /api/whoami and header identity display. Use the authorization system’s role model (admin/user/guest) for consistent UI logic; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire a new TanStack Router route for path \"/api/whoami\" that renders WhoAmIPage, ensuring it is part of the SPA route tree."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Display the authenticated user’s Principal in the main UI with a way to view/copy the full value.",
      "acceptanceCriteria": [
        "When a user is authenticated, the UI displays a recognizable Principal indicator (e.g., first/last characters).",
        "There is a clear way to view/copy the full Principal from the UI without needing to navigate to admin routes.",
        "When logged out, the Principal indicator is not shown (or clearly indicates the user is not logged in)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PrincipalIndicator.tsx",
          "operation": "create",
          "description": "Create a header-friendly PrincipalIndicator component that shows a shortened Principal when authenticated and provides an explicit action to view/copy the full Principal (e.g., dialog/details + Copy button) with a sonner toast confirmation. Base auth/role decisions on the authorization system’s role model; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Render PrincipalIndicator in the authenticated header area (only when identity is present). Ensure the component can access caller info (principal/role) via the new hook and provides copy/view without requiring navigation to admin routes."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Improve Access Denied messaging with troubleshooting guidance and a link to /api/whoami for admin enablement.",
      "acceptanceCriteria": [
        "The Access Denied screen includes a visible link to \"/api/whoami\" and instructs the user to copy and share the Principal with the site administrator.",
        "User-facing text is in English and clearly distinguishes ‘not admin’ from ‘not logged in’."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update AccessDeniedScreen copy to include troubleshooting guidance and a visible link to \"/api/whoami\" with instructions to copy/share the Principal for admin enablement. Adjust messaging to clearly differentiate not logged in (guest) vs logged in but not admin."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Pass enough state into AccessDeniedScreen (e.g., derived from role/identity) so the screen can distinguish between guest (not logged in) and authenticated non-admin, while keeping admin gating behavior unchanged."
        }
      ]
    }
  ]
}